{% macro searchad__campaign_type_mapping() -%}
SELECT *
FROM (VALUES
    (0, 1, '파워링크')
  , (1, 2, '쇼핑검색')
  , (2, 3, '파워컨텐츠')
  , (3, 4, '브랜드검색/신제품검색')
  , (4, 5, '플레이스')
  , (5, 101, '웹사이트 전환')
  , (6, 102, '인지도 및 트래픽')
  , (7, 103, '앱 전환')
  , (8, 104, '동영상 조회')
  , (9, 105, '카탈로그 판매')
  , (10, 106, '쇼핑 프로모션')
  , (11, 107, '참여 유도')
  , (12, 108, 'ADVoost 쇼핑')
) AS mapping(seq, code, label)
{%- endmacro %}

-- fallback mapping for campaign ads
{% macro searchad__campaign_ad_type_mapping() -%}
SELECT *
FROM (VALUES
    (0, 1, '파워링크-단일형 소재')
  , (1, 2, '쇼핑검색-상품형 소재')
  , (2, 3, '파워컨텐츠-정보형 소재')
  , (3, 4, '브랜드검색-일반형 소재')
  , (4, 5, '플레이스-플레이스 검색 소재')
  , (5, 101, '웹사이트 전환')
  , (6, 102, '성과형-기타')
  , (7, 103, '성과형-기타')
  , (8, 104, '성과형-동영상')
  , (9, 105, '성과형-카탈로그')
  , (10, 106, '성과형-기타')
  , (11, 107, '성과형-기타')
  , (12, 108, '성과형-ADVoost 소재')
) AS mapping(seq, code, label)
{%- endmacro %}

{% macro searchad__adgroup_type_mapping() -%}
SELECT *
FROM (VALUES
    (0, 1, '파워링크')
  , (1, 2, '쇼핑검색-쇼핑몰 상품형')
  , (2, 3, '파워컨텐츠-정보형')
  , (3, 4, '파워컨텐츠-상품형')
  , (4, 5, '브랜드검색-일반형')
  , (5, 6, '플레이스-지역소상공인')
  , (6, 7, '쇼핑검색-제품 카탈로그형')
  , (7, 8, '브랜드검색-브랜드형')
  , (8, 9, '쇼핑검색-쇼핑 브랜드형')
  , (9, 10, '플레이스-플레이스검색')
  , (10, 11, '브랜드검색-신제품검색형')
  , (11, 101, '성과형-클릭 수 최대화')
  , (12, 102, '성과형-전환 수 최대화')
  , (13, 103, '성과형-전환 가치 최대화')
  , (14, 104, '성과형-수동 입찰')
) AS mapping(seq, code, label)
{%- endmacro %}

{% macro searchad__ad_type_mapping() -%}
SELECT *
FROM (VALUES
    (0, 1, '파워링크-단일형 소재')
  , (1, 2, '쇼핑검색-상품형 소재')
  , (2, 3, '파워컨텐츠-정보형 소재')
  , (3, 4, '파워컨텐츠-상품형 소재')
  , (4, 5, '브랜드검색-일반형 소재')
  , (5, 6, '플레이스-지역소상공인 소재')
  , (6, 7, '쇼핑검색-카탈로그형 소재')
  , (8, 9, '쇼핑검색-쇼핑 브랜드형 소재')
  , (9, 10, '플레이스-플레이스 검색 소재')
  , (10, 11, '브랜드검색-신제품검색형 소재')
  , (11, 12, '쇼핑검색-쇼핑 브랜드형 이미지 섬네일형 소재')
  , (12, 13, '쇼핑검색-쇼핑 브랜드형 이미지 배너형 소재')
  , (13, 101, '성과형-네이티브 이미지')
  , (14, 102, '성과형-컬렉션')
  , (15, 103, '성과형-동영상')
  , (16, 104, '성과형-이미지 배너')
  , (17, 105, '성과형-카탈로그')
  , (18, 106, '성과형-ADVoost 소재')
) AS mapping(seq, code, label)
{%- endmacro %}

{% macro searchad__device_type_mapping() -%}
SELECT *
FROM (VALUES
    (0, 0, 'PC')
  , (1, 1, '모바일')
  , (2, 2, '기타')
  , (9, 9, '성과형')
) AS mapping(seq, code, label)
{%- endmacro %}

{% macro searchad__contract_type_mapping() -%}
SELECT *
FROM (VALUES
    (0, 0, '브랜드검색-신제품검색형 소재')
  , (1, 1, '브랜드검색-일반형 소재')
) AS mapping(seq, code, label)
{%- endmacro %}
